#!/usr/local/bin/python
# -*- coding: utf-8 -*-
from pythainlp.tokenize import word_tokenize
#from pythainlp.spell.pn import correction
def type1():
    print("\nคุณต้องการทราบทางไปไหนคะ? (ใส่ชื่อสถานที่ เช่น อาคารเรียนรวม2 หรือ cb2)")
    dest = input()
    if dest == "บริเวณหน้ามหาวิทยาลัย" or dest == "หน้ามหาวิทยาลัย" or dest == "หน้ามหาลัย" or dest == "หน้ามอ" or dest == "หน้าม" :
        print("ตอบทางไปบริเวณหน้ามหาวิทยาลัย")
    if dest == "อาคารสัมมนา" or dest == "อาคารสัมมะนา" or dest == "อาคารสัมนา" or dest == "สัมมนา" :
        print("ตอบทางไปอาคารสัมมนา")
    if dest == "อาคารจอดรถ" or dest == "ที่จอดรถ" or dest == "ตึกจอดรถ" or dest == "จอดรถที่ไหน" :
        print("ตอบทางไปอาคารจอดรถ")
    if dest == "โรงเรียนดรุณศึกษาลัย" or dest == "โรงเรียนดรุณ" or dest == "ดรุณศึกษาลัย" or dest == "ดรุณ" or dest == "ตึกดรุณ" or dest == "รรดรุณ" or dest == "ร.ร.ดรุณ" or dest == "รร.ดรุณ" :
        print("ตอบทางไปโรงเรียนดรุณศึกษาลัย")
    if dest == "ศูนย์หนังสือพระจอมเกล้าธนบุรี" or dest == "ศูนย์หนังสือมจธ." or dest == "ศูนย์หนังสือมจธ" or dest == "ศูนย์หนังสือ" or dest == "ศูนย์นส.มจธ." or dest == "ศูนย์นสมจธ" or dest == "ศูนย์นส." or dest == "ศูนย์นส":
        print("ตอบทางไปศูนย์หนังสือพระจอมเกล้าธนบุรี")
    if dest == "ที่ทำการไปรษณีย์มจธ." or dest == "ที่ทำการไปรษณีย์มจธ" or dest == "ไปรษณีย์มจธ." or dest == "ไปรษณีย์มจธ" or dest == "ที่ทำการไปรษณีย์" or dest == "ไปรษณี" or dest == "ไปรษณีย์" :
        print("ตอบทางไปที่ทำการไปรษณีย์มจธ.")
    if dest == "อาคารหอพักนักศึกษาหญิง" or dest == "อาคารหอพักนศ.หญิง" or dest == "อาคารหอพักนักศึกษาญ" or dest == "บ้านธรรมรักษา1" or dest == "หอพักนักศึกษาหญิง" or dest == "หอพักหญิง" or dest == "หอนักศึกษาหญิง" or dest == "หอหญิง" or dest == "หอญ" or dest == "โรงอาหารใต้หอพักหญิง" or dest == "โรงอาหารหอพักหญิง" or dest == "โรงอาหารหอญ" or dest == "โรงอาหารหอพักญ" :
        print("ตอบเส้นทางไปหอหญิง")
    if dest == "อาคารหอพักนักศึกษาชาย" or dest == "อาคารหอพักนศ.ชาย" or dest == "อาคารหอพักนักศึกษาช" or dest == "บ้านธรรมรักษา2" or dest == "หอพักนักศึกษาชาย" or dest == "หอพักชาย" or dest == "หอนักศึกษาชาย" or dest == "หอชาย" or dest == "หอช" or dest == "โรงอาหารใต้หอพักชาย" or dest == "โรงอาหารหอพักชาย" or dest == "โรงอาหารหอช" or dest == "โรงอาหารหอพักช" :
        print("ตอบเส้นทางไปหอชาย")
    if dest == "อาคารวิศวะวัฒนะ" or dest == "วิศวะวัฒนะ" or dest == "อาคารวิศววัฒนะ" or dest == "ตึกแดง" :
        print("ตอบทางไปอาคารวิศวะวัฒนะ")
    if dest == "อาคารพัฒนาเด็กเล็ก" or dest == "ตึกพัฒนาเด็กเล็ก" or dest == "พัฒนาเด็กเล็ก" or dest == "อาคารเด็กเล็ก" or dest == "อาคารเด็ก" :
        print("ตอบทางไปอาคารพัฒนาเด็กเล็ก")        
    if dest == "อาคารเรียนรวม1" or dest == "cb1" or dest == "CB1" or dest == "Cb1" :
        print("ตอบทางไปCB1")
    if dest == "อาคารเรียนรวม2" or dest == "cb2" or dest == "CB2" or dest == "Cb2" :
        print("ตอบทางไปCB2")
    if dest == "อาคารเรียนรวม3" or dest == "cb3" or dest == "CB3" or dest == "Cb3" :
        print("ตอบทางไปCB3")
    if dest == "อาคารเรียนรวม4" or dest == "cb4" or dest == "CB4" or dest == "Cb4" :
        print("ตอบทางไปCB4")
    if dest == "อาคารเรียนรวม5" or dest == "cb5" or dest == "CB5" or dest == "Cb5" :
        print("ตอบทางไปCB5")
    if dest == "อาคารเรียนรวม2" or dest == "cb2" or dest == "CB2" or dest == "Cb2" :
        print("ตอบทางไปCB2")
    if dest == "อาคารพระจอมเกล้าราชานุสรณ์ 190 ปี (โรงอาหาร)" or dest == "อาคารพระจอมเกล้าราชานุสรณ์" or dest == "พระจอมเกล้าราชานุสรณ์" or dest == "โรงอาหาร" or dest == "โรงอาหารเคเอฟซี" or dest == "เคเอฟซี" or dest == "KFC" or dest == "Kfc" or dest == "kfc" :
        print("ตอบทางไปอาคารพระจอมเกล้าราชานุสรณ์ 190 ปี (โรงอาหาร)")
    if dest == "ร้านสหกรณ์มจธ." or dest == "ร้านสหกรณ์มจธ" or dest == "สหกรณ์มจธ." or dest == "สหกรณ์มจธ" or dest == "ร้านสหกรณ์" or dest == "สหกรณ์" or dest == "สหกร" :
        print("ตอบทางไปร้านสหกรณ์")
    if dest == "สำนักหอสมุดและบรรณาสารสนเทศ" or dest == "หอสมุดและบรรณาสารสนเทศ" or dest == "สำนักหอสมุด" or dest == "บรรณาสารสนเทศ" or dest == "หอสมุด" or dest == "ห้องสมุด" :
        print("ตอบทางไปหอสมุด")
    if dest == "สำนักงานอธิการบดี" or dest == "สำนักงานอธิการ" or dest == "ตึกอธิการบดี" or dest == "ตึกอธิการ" :
        print("ตอบทางไปตึกอธิการ")
    if dest == "อาคารสถาบันหุ่นยนต์ภาคสนาม" or dest == "อาคารสถาบันหุ่นยนต์" or dest == "สถาบันหุ่นยนต์ภาคสนาม" or dest == "สถาบันหุ่นยนต์" or dest == "อาคารเรียนฟิโบ" or dest == "อาคารเรียนฟิโบ่" or dest == "อาคารเรียนฟิโบ้" or dest == "ตึกฟิโบ" or dest == "ตึกฟิโบ่" or dest == "ตึกฟิโบ้" or dest == "ตึกfibo" or dest == "ตึกFIBO" or dest == "ตึก fibo" or dest == "ตึก FIBO" or dest == "fibo":
        print("ตอบทางไปอาคารสถาบันหุ่นยนต์")
    if dest == "อาคารคณะเทคโนโลยีสารสนเทศ" or dest == "อาคารเรียนคณะเทคโนโลยีสารสนเทศ" or dest == "อาคารเรียนคณะเทคโนโลยี" or dest == "คณะเทคโนโลยีสารสนเทศ" or dest == "คณะเทคโนโลยี" or dest == "ตึกคณะเทคโนโลยีสารสนเทศ" or dest == "ตึกคณะไอที" or dest == "ตึกไอที" or dest == "ตึกit" or dest == "ตึกIT" or dest == "ตึกIt" or dest == "ตึก it" or dest == "ตึก IT" or dest == "ตึก It" :
        print("ตอบเส้นทางไปอาคารคณะเทคโนโลยีสารสนเทศ")
    if dest == "อาคารเรียนวิศวกรรมเคมี" or dest == "อาคารวิศวกรรมเคมี" or dest == "อาคารวิศวะเคมี" or dest == "อาคารเคมี" or dest == "ตึกวิศวกรรมเคมี" or dest == "ตึกวิศวะเคมี" or dest == "วิศวะเคมี" or dest == "ตึกเคมี" :
        print("ตอบเส้นทางไปตึกเคมี")
    if dest == "ที่พัก Heliconia House" or dest == "ที่พัก heliconia house" or dest == "ที่พักHeliconia House" or dest == "ที่พักheliconia house" or dest == "Heliconia House" or dest == "heliconia house" or dest == "Heliconia" or dest == "heliconia":
        print("ตอบทางไปที่พัก Heliconia House")
    return  
def type2(typeAsk):
    print("คุณต้องการทราบอะไรคะ")
    print("กรุณาถามทีละคำถามเพื่อให้ iGuide ตอบคำถามคุณได้ตรงคำถามนะคะ")
    olddetail=""
    while 1:
        detail = input()
        print("detail: "+detail)
        cutdetail = word_tokenize(detail)
        print(cutdetail)
        qclear=0
        #ทุน
        if "ทุน" in detail or "ทุนการศึกษา" in detail:
            qclear=1
        #ทุนการศึกษาเพื่อคัดเลือกนักศึกษาเชิงรุก (ก่อนเข้าศึกษา) ปตรี
            #ทุนเพชร
            if "เพชร" in detail or "พระจอม" in detail:
                qclear=2
                print("ทุนการศึกษาเพชรพระจอมเกล้าระดับปริญญาตรี คือ ทุนการศึกษาเพื่อคัดเลือกนักศึกษาเชิงรุกให้ได้ผู้ที่มีความเป็นเลิศในด้านต่างๆ ทั้งด้านวิชาการดีเด่นและความสามารถเฉพาะด้าน ได้แก่ กีฬา ผู้นำ ศิลปวัฒนธรรม และความคิดสร้างสรรค์และนวัตกรรม ผู้ที่ได้รับทุนนี้จะเป็นผู้นำเพื่อการเปลี่ยนแปลง (Change Agent) ในสังคมนักศึกษา มจธ.")
            #ทุนเก่งและดี
            if "50 ปี มจธ." in detail or "เก่งและดี" in detail :
                qclear=2
                print("ทุนการศึกษา 50 ปี มจธ. 50 ทุน สร้างคนเก่งและดี ในโอกาสครบ 50 ปี แห่งการก่อตั้ง มจธ. มหาวิทยาลัยฯ สนับสนุนทุนการศึกษาเพื่อสร้างคนเก่งและดีตามวิสัยทัศน์ โดยคัดสรรนักเรียนที่ดี มีคุณธรรม จริยธรรม มีจิตใจในการบริการสังคม และมีฉันทะที่จะเข้าศึกษาต่อในสาขาต่าง ๆ ของ มจธ.")
            #ทุนธรรมรักษา
            if "ธรรมรักษา" in detail:
                qclear=2
                print("ทุนการศึกษาธรรมรักษา ทุนการศึกษาสำหรับนักเรียนที่มีคุณธรรมแต่ครอบครัวขาดโอกาสโดยไม่มีบุคคลในครอบครัวสำเร็จการศึกษาระดับอุดมศึกษา และมีภูมิลำเนาในพื้นที่ทุรกันดารห่างไกลความเจริญ หรือพื้นที่เสี่ยงต่อความมั่นคงของประเทศ ให้ได้เข้าศึกษาในมหาวิทยาลัย เพื่อเป็นกำลังสำคัญในการพัฒนาครอบครัว และสังคมหลังสำเร็จการศึกษา")
        #ทุนการศึกษาสำหรับนักศึกษาปัจจุบัน ปตรี
            #ทุนการศึกษาเจียระไนเพชร
            if "เจียระไนเพชร" in detail or "เจียระไน" in detail or "เจียรไน" in detail or "เจียรนัย" in detail or "เจียระนัย" in detail :
                qclear=2
                print("ทุนการศึกษาเจียระไนเพชร ทุนพัฒนาศักยภาพและส่งเสริมนักศึกษาที่มีผลงานโดดเด่นเป็นที่ยอมรับทั้งระดับประเทศและนานาชาติ ในด้านวิชาการและความสามารถเฉพาะด้านต่าง ๆ เช่น กีฬา ผู้นำ ศิลปวัฒนธรรม และความคิดสร้างสรรค์และนวัตกรรม รวมทั้งส่งเสริม สนับสนุน และสร้างขวัญกำลังใจให้กับนักศึกษาที่สร้างชื่อเสียงให้แก่มหาวิทยาลัย")
            #ทุนให้เปล่าจากบริษัทและผู้มีจิตกุศล
            if "ให้เปล่า" in detail or "จิตกุศล" in detail:
                qclear=2
                print("ทุนให้เปล่าจากบริษัทและผู้มีจิตกุศล ทุนการศึกษาที่ได้รับจากบริษัท ห้างร้าน และผู้มีจิตกุศล เพื่อช่วยเหลือนักศึกษาที่ขาดแคลนทุนทรัพย์ แต่มีผลการเรียนและความประพฤติดี ในแต่ละปีมหาวิทยาลัยได้รับเงินบริจาคมากกว่า 200 ทุน ทั้งแบบต่อเนื่องจนจบหลักสูตรและแบบรายปี ตามวัตถุประสงค์ของผู้บริจาค")
            #ทุนจ้างงานนักศึกษา
            if "จ้างงาน" in detail:
                qclear=2
                print("ทุนจ้างงานนักศึกษา ทุนจ้างงานนักศึกษาเป็นกลไกการพัฒนานักศึกษา ส่งเสริมให้ใช้เวลาว่างให้เกิดประโยชน์ เป็นการฝึกทักษะทางสังคม สร้างความรับผิดชอบและหารายได้พิเศษ ในแต่ละภาคการศึกษา มจธ. มีทุนจ้างงานนักศึกษาจำนวนมาก ซึ่งผู้รับทุนต้องปฏิบัติงานที่หน่วยงานต่างๆ ของมหาวิทยาลัย")
            #ทุนจ้างงานผู้ช่วยวิจัย
            if "ผู้ช่วยวิจัย" in detail or "ผู้ช่วย" in detail:
                qclear=2
                print("ทุนจ้างงานผู้ช่วยวิจัย ทุนที่ทำให้นักศึกษามีโอกาสเข้าถึงและสร้างทักษะการทำงานวิจัยด้านวิทยาศาสตร์และเทคโนโลยีตั้งแต่ระดับปริญญาตรี สร้างความรับผิดชอบและให้มีฉันทะในการเรียนเนื่องจากเป็นการเรียนรู้นอกห้องเรียนผ่านการปฏิบัติงานจริง โดยผู้รับทุนต้องทำงานในกลุ่มวิจัยต่างๆ ของมหาวิทยาลัย ภายใต้การดูแลของอาจารย์ที่ปรึกษางานวิจัย")
            #กยศ
            if "กยศ." in detail or "กยศ" in detail  or "กู้ยืม" in detail or "กองทุนให้กู้ยืมเพื่อการศึกษาของรัฐบาล" in detail:
                qclear=2
                print("กองทุนให้กู้ยืมเพื่อการศึกษาของรัฐบาล (กยศ.) และกองทุนเงินกู้ยืมเพื่อการศึกษาที่ผูกกับรายได้ในอนาคต (กรอ.) รัฐบาลให้การสนับสนุนการขยายโอกาสและพัฒนาการศึกษาของประเทศ เพื่อให้เยาวชนไทยได้รับการศึกษาที่มีคุณภาพได้มาตรฐานอย่างเท่าเทียม โดยให้เงินกู้ยืมแก่นักเรียนนักศึกษาที่ขาดแคลนทุนทรัพย์ เพื่อเป็นค่าเล่าเรียน ค่าใช้จ่ายเกี่ยวกับการศึกษา และค่าใช้จ่ายจำเป็นในการครองชีพระหว่างศึกษา การให้ทุนพิจารณาจากรายได้ของครอบครัวเป็นหลักและผู้ได้รับทุน (ผู้กู้) เริ่มใช้คืนเมื่อมีรายได้เพียงพอสามารถเลี้ยงตัวได้")
        #ทุนการศึกษาเพื่อคัดเลือกนักศึกษาเชิงรุก (ก่อนเข้าศึกษา) บัณฑิต
            if "เพชรพระจอมเกล้าด้านวิชาการดีเด่น" in detail or "เพชรพระจอมเกล้าสนับสนุนกลุ่มวิจัยระดับปริญญาโท" in detail or "สนับสนุนกลุ่มวิจัย" in detail:
                qclear=2
                print("ทุนการศึกษาเพชรพระจอมเกล้าด้านวิชาการดีเด่นและทุนการศึกษาเพชรพระจอมเกล้าสนับสนุนกลุ่มวิจัยระดับปริญญาโท ทุนการศึกษาเพชรพระจอมเกล้าสำหรับนักศึกษาระดับปริญญาโท ที่มีศักยภาพและความสามารถ มีความพึงพอใจใฝ่รู้ โดยให้การสนับสนุนตามระยะเวลาการศึกษาที่ระบุไว้ในหลักสูตร")
                print("สามารถดูรายละเอียดทุนต่างๆได้ที่ http://admission.kmutt.ac.th/afford")
            if "เพชรพระจอมเกล้าดุษฎีบัณฑิต" in detail or "ดุษฎีบัณฑิต" in detail or "ปริญญาเอก" in detail or "ป.เอก" in detail or "ปเอก" in detail or "ปอเอก" in detail:
                qclear=2
                print("ทุนการศึกษาเพชรพระจอมเกล้าดุษฎีบัณฑิต เป็นทุนเพื่อให้นักศึกษาทุ่มเทเวลาให้กับการศึกษาระดับปริญญาเอกและเสริมสร้างประสบการณ์การทำงานวิจัยและพัฒนาอย่างต่อเนื่อง เพื่อพัฒนาตนเองให้เป็นดุษฎีบัณฑิตคุณภาพที่จะเป็นกำลังสำคัญในการขับเคลื่อนและผลิตผลงานวิจัย หรือปฏิบัติงานที่ใช้ความรู้และทักษะขั้นสูงที่เป็นประโยชน์ต่อสังคมและเศรษฐกิจของประเทศ")
                print("สามารถดูรายละเอียดทุนต่างๆได้ที่ http://admission.kmutt.ac.th/afford")
        #ทุนการศึกษาสำหรับนักศึกษาปัจจุบัน บัณฑิต
            #ทุนผู้ช่วยวิจัย
            if "ผู้ช่วยวิจัย" in detail or "ผู้ช่วย" in detail or "Research Assistant" in detail or "Teaching Assistant" in detail or "TA" in detail:
                qclear=2
                print("ทุนผู้ช่วยวิจัย (Research Assistant) / ผู้ช่วยสอน (Teaching Assistant) ทุนการศึกษาสำหรับนักศึกษาระดับบัณฑิตศึกษา โดยผู้ช่วยวิจัยรับผิดชอบงานในโครงการวิจัย/ช่วยวิจัย ร่วมกับอาจารย์/นักวิจัย ตามที่ได้รับมอบหมาย ผู้ช่วยสอน ต้องปฏิบัติหน้าที่ผู้ช่วยสอน หรืองานอื่นๆ ที่ได้รับมอบหมาย สามารถดูรายละเอียดทุนต่างๆได้ที่ http://admission.kmutt.ac.th/afford")
            #ทุนโครงการพัฒนาเสริมสร้างความรู้งานวิจัยด้านวิทยาศาสตร์ระบบโลก
            if "โครงการพัฒนาเสริมสร้างความรู้งานวิจัยด้านวิทยาศาสตร์ระบบโลก" in detail or "พัฒนาเสริมสร้างความรู้" in detail or "วิทยาศาสตร์" in detail or "ระดับโลก" in detail:
                qclear=2
                print("ทุนการศึกษาระดับบัณฑิตศึกษา โครงการพัฒนาเสริมสร้างความรู้งานวิจัยด้านวิทยาศาสตร์ระบบโลก มีทุนการศึกษาให้กับนักศึกษาที่มีคุณสมบัติเหมาะสม ไม่เกิน 50,000 บาทต่อปี ในระดับปริญญาเอก และไม่เกิน 40,000 บาทต่อปี ในระดับปริญญาโท และ/หรือจะได้รับทุนสนับสนุนค่าใช้จ่ายประจำเดือน จำนวน 8,000 บาทต่อเดือนเป็นระยะ 1 ปีการศึกษา (12 เดือน) ทั้งนี้ขึ้นอยู่กับการพิจารณาของคณะกรรมการบริหารโครงการฯ")
                print("สนใจติดต่อได้ที่: โครงการพัฒนาเสริมสร้างความรู้งานวิจัยด้านวิทยาศาสตร์ระบบโลก (Earth Systems Science: ESS) ตึกคณะพลังงานสิ่งแวดล้อมและวัสดุ ชั้น 11 โทรศัพท์ 02-4708309-10 ต่อ 4151 โทรสาร  02-4708309-10 ต่อ 4154  E-mail address : saipin.poo@kmutt.ac.th หรือดูรายละเอียดเพิ่มเติมได้ที่ www.ess.kmutt.ac.th นะคะ")
                 #ุแสดงทุนระดับปริญญาตรีทั้งหมด
            if "ปริญญาตรี" in detail or "ป.ตรี" in detail or "ป. ตรี" in detail or "ปตรี" in detail or "ป ตรี" in detail or "ปอตรี" in detail: 
                qclear=2
                print("ทุนการศึกษาระดับปริญญาตรีมี 2 ประเภท คือ ทุนการศึกษาสำหรับนักศึกษาปัจจุบัน และ ทุนการศึกษาเพื่อคัดเลือกนักศึกษาเชิงรุก(ก่อนเข้าศึกษา)")
                print("คุณอยากทราบข้อมูลของทุนประเภทไหน (สำหรับนศ.ปัจจุบัน หรือ ทุนก่อนเข้าศึกษา)")
                detail1=input()
                if "สำหรับนศ.ปัจจุบัน" in detail1 or "ปัจจุบัน" in detail1:
                    print("ทุนสำหรับนศ.ปัจจุบัน จะมีทั้งหมด 5 ทุน")
                    print("1.ทุนการศึกษาเจียระไนเพชร ทุนพัฒนาศักยภาพและส่งเสริมนักศึกษาที่มีผลงานโดดเด่นเป็นที่ยอมรับทั้งระดับประเทศและนานาชาติ ในด้านวิชาการและความสามารถเฉพาะด้านต่าง ๆ เช่น กีฬา ผู้นำ ศิลปวัฒนธรรม และความคิดสร้างสรรค์และนวัตกรรม รวมทั้งส่งเสริม สนับสนุน และสร้างขวัญกำลังใจให้กับนักศึกษาที่สร้างชื่อเสียงให้แก่มหาวิทยาลัย")
                    print("2.ทุนให้เปล่าจากบริษัทและผู้มีจิตกุศล ทุนการศึกษาที่ได้รับจากบริษัท ห้างร้าน และผู้มีจิตกุศล เพื่อช่วยเหลือนักศึกษาที่ขาดแคลนทุนทรัพย์ แต่มีผลการเรียนและความประพฤติดี ในแต่ละปีมหาวิทยาลัยได้รับเงินบริจาคมากกว่า 200 ทุน ทั้งแบบต่อเนื่องจนจบหลักสูตรและแบบรายปี ตามวัตถุประสงค์ของผู้บริจาค")
                    print("3.ทุนจ้างงานนักศึกษา ทุนจ้างงานนักศึกษาเป็นกลไกการพัฒนานักศึกษา ส่งเสริมให้ใช้เวลาว่างให้เกิดประโยชน์ เป็นการฝึกทักษะทางสังคม สร้างความรับผิดชอบและหารายได้พิเศษ ในแต่ละภาคการศึกษา มจธ. มีทุนจ้างงานนักศึกษาจำนวนมาก ซึ่งผู้รับทุนต้องปฏิบัติงานที่หน่วยงานต่างๆ ของมหาวิทยาลัย")
                    print("4.ทุนจ้างงานผู้ช่วยวิจัย ทุนที่ทำให้นักศึกษามีโอกาสเข้าถึงและสร้างทักษะการทำงานวิจัยด้านวิทยาศาสตร์และเทคโนโลยีตั้งแต่ระดับปริญญาตรี สร้างความรับผิดชอบและให้มีฉันทะในการเรียนเนื่องจากเป็นการเรียนรู้นอกห้องเรียนผ่านการปฏิบัติงานจริง โดยผู้รับทุนต้องทำงานในกลุ่มวิจัยต่างๆ ของมหาวิทยาลัย ภายใต้การดูแลของอาจารย์ที่ปรึกษางานวิจัย")
                    print("5.กองทุนให้กู้ยืมเพื่อการศึกษาของรัฐบาล (กยศ.) และกองทุนเงินกู้ยืมเพื่อการศึกษาที่ผูกกับรายได้ในอนาคต (กรอ.) รัฐบาลให้การสนับสนุนการขยายโอกาสและพัฒนาการศึกษาของประเทศ เพื่อให้เยาวชนไทยได้รับการศึกษาที่มีคุณภาพได้มาตรฐานอย่างเท่าเทียม โดยให้เงินกู้ยืมแก่นักเรียนนักศึกษาที่ขาดแคลนทุนทรัพย์ เพื่อเป็นค่าเล่าเรียน ค่าใช้จ่ายเกี่ยวกับการศึกษา และค่าใช้จ่ายจำเป็นในการครองชีพระหว่างศึกษา การให้ทุนพิจารณาจากรายได้ของครอบครัวเป็นหลักและผู้ได้รับทุน (ผู้กู้) เริ่มใช้คืนเมื่อมีรายได้เพียงพอสามารถเลี้ยงตัวได้")
                    print("สามารถดูรายละเอียดทุนต่างๆได้ที่ http://admission.kmutt.ac.th/afford")
                if "ทุนก่อนเข้าศึกษา" in detail1 or "ก่อน" in detail1:
                    print("สำหรับทุนก่อนเข้าศึกษา จะมีทั้งหมด 3 ทุน")
                    print("1.ทุนการศึกษาเพชรพระจอมเกล้าระดับปริญญาตรี คือ ทุนการศึกษาเพื่อคัดเลือกนักศึกษาเชิงรุกให้ได้ผู้ที่มีความเป็นเลิศในด้านต่างๆ ทั้งด้านวิชาการดีเด่นและความสามารถเฉพาะด้าน ได้แก่ กีฬา ผู้นำ ศิลปวัฒนธรรม และความคิดสร้างสรรค์และนวัตกรรม ผู้ที่ได้รับทุนนี้จะเป็นผู้นำเพื่อการเปลี่ยนแปลง (Change Agent) ในสังคมนักศึกษา มจธ.")
                    print("2.ทุนการศึกษา 50 ปี มจธ. 50 ทุน สร้างคนเก่งและดี ในโอกาสครบ 50 ปี แห่งการก่อตั้ง มจธ. มหาวิทยาลัยฯ สนับสนุนทุนการศึกษาเพื่อสร้างคนเก่งและดีตามวิสัยทัศน์ โดยคัดสรรนักเรียนที่ดี มีคุณธรรม จริยธรรม มีจิตใจในการบริการสังคม และมีฉันทะที่จะเข้าศึกษาต่อในสาขาต่าง ๆ ของ มจธ.")
                    print("3.ทุนการศึกษาธรรมรักษา ทุนการศึกษาสำหรับนักเรียนที่มีคุณธรรมแต่ครอบครัวขาดโอกาสโดยไม่มีบุคคลในครอบครัวสำเร็จการศึกษาระดับอุดมศึกษา และมีภูมิลำเนาในพื้นที่ทุรกันดารห่างไกลความเจริญ หรือพื้นที่เสี่ยงต่อความมั่นคงของประเทศ ให้ได้เข้าศึกษาในมหาวิทยาลัย เพื่อเป็นกำลังสำคัญในการพัฒนาครอบครัว และสังคมหลังสำเร็จการศึกษา")
                    print("สามารถดูรายละเอียดทุนต่างๆได้ที่ http://admission.kmutt.ac.th/afford")
            #แสดงทุนระดับบัณฑิตศึกษาทั้งหมด
            if "บัณฑิตศึกษา" in detail or "บัณฑิต" in detail or "บันฑิต" in detail or "บันดิด" in detail or "บัณฑิด" in detail or "ปริญญาโท" in detail or "ป.โท" in detail or "ปโท" in detail or "ปริญญาเอก" in detail or "ป.เอก" in detail or "ปเอก" in detail: 
                qclear=2
                print("ทุนการศึกษาระดับบัณฑิตศึกษามี 2 ประเภท คือ ทุนการศึกษาสำหรับนักศึกษาปัจจุบัน และ ทุนการศึกษาเพื่อคัดเลือกนักศึกษาเชิงรุก(ก่อนเข้าศึกษา)")
                print("คุณอยากทราบข้อมูลของทุนประเภทไหน (สำหรับนศ.ปัจจุบัน หรือ ทุนก่อนเข้าศึกษา)")
                detail1=input()
                if "สำหรับนศ.ปัจจุบัน" in detail1 or "นศ.ปัจจุบัน" in detail1 or "ปัจจุบัน" in detail1:
                    print("ทุนสำหรับนศ.ปัจจุบันจะมี 2 ประเภท")
                    print("1.ทุนผู้ช่วยวิจัย (Research Assistant) / ผู้ช่วยสอน (Teaching Assistant) ทุนการศึกษาสำหรับนักศึกษาระดับบัณฑิตศึกษา โดยผู้ช่วยวิจัยรับผิดชอบงานในโครงการวิจัย/ช่วยวิจัย ร่วมกับอาจารย์/นักวิจัย ตามที่ได้รับมอบหมาย ผู้ช่วยสอน ต้องปฏิบัติหน้าที่ผู้ช่วยสอน หรืองานอื่นๆ ที่ได้รับมอบหมาย สามารถดูรายละเอียดทุนต่างๆได้ที่ http://admission.kmutt.ac.th/afford")
                    print("2.ทุนการศึกษาระดับบัณฑิตศึกษา โครงการพัฒนาเสริมสร้างความรู้งานวิจัยด้านวิทยาศาสตร์ระบบโลก มีทุนการศึกษาให้กับนักศึกษาที่มีคุณสมบัติเหมาะสม ไม่เกิน 50,000 บาทต่อปี ในระดับปริญญาเอก และไม่เกิน 40,000 บาทต่อปี ในระดับปริญญาโท และ/หรือจะได้รับทุนสนับสนุนค่าใช้จ่ายประจำเดือน จำนวน 8,000 บาทต่อเดือนเป็นระยะ 1 ปีการศึกษา (12 เดือน) ทั้งนี้ขึ้นอยู่กับการพิจารณาของคณะกรรมการบริหารโครงการฯ สนใจติดต่อได้ที่: โครงการพัฒนาเสริมสร้างความรู้งานวิจัยด้านวิทยาศาสตร์ระบบโลก (Earth Systems Science: ESS) ตึกคณะพลังงานสิ่งแวดล้อมและวัสดุ ชั้น 11 โทรศัพท์ 02-4708309-10 ต่อ 4151 โทรสาร  02-4708309-10 ต่อ 4154  E-mail address : saipin.poo@kmutt.ac.th หรือดูรายละเอียดเพิ่มเติมได้ที่ www.ess.kmutt.ac.th นะคะ")
                if "ทุนก่อนเข้าศึกษา" in detail1 or "ก่อน" in detail1:  
                    print("สำหรับทุนก่อนเข้าศึกษา จะมีทั้งหมด 2 ประเภท")
                    print("1.ทุนการศึกษาเพชรพระจอมเกล้าด้านวิชาการดีเด่นและทุนการศึกษาเพชรพระจอมเกล้าสนับสนุนกลุ่มวิจัยระดับปริญญาโท ทุนการศึกษาเพชรพระจอมเกล้าสำหรับนักศึกษาระดับปริญญาโท ที่มีศักยภาพและความสามารถ มีความพึงพอใจใฝ่รู้ โดยให้การสนับสนุนตามระยะเวลาการศึกษาที่ระบุไว้ในหลักสูตร")
                    print("2.ทุนการศึกษาเพชรพระจอมเกล้าดุษฎีบัณฑิต ทุนการศึกษาเพชรพระจอมเกล้าดุษฎีบัณฑิต เพื่อให้นักศึกษาทุ่มเทเวลาให้กับการศึกษาระดับปริญญาเอกและเสริมสร้างประสบการณ์การทำงานวิจัยและพัฒนาอย่างต่อเนื่อง เพื่อพัฒนาตนเองให้เป็นดุษฎีบัณฑิตคุณภาพที่จะเป็นกำลังสำคัญในการขับเคลื่อนและผลิตผลงานวิจัย หรือปฏิบัติงานที่ใช้ความรู้และทักษะขั้นสูงที่เป็นประโยชน์ต่อสังคมและเศรษฐกิจของประเทศ")
                    print("สามารถดูรายละเอียดทุนต่างๆได้ที่ http://admission.kmutt.ac.th/afford")
            #ติดต่อเรื่องทุนการศึกษา
            if "ติดต่อ" in detail or "โทร" in detail :
                qclear=2
                print("สามารถติดต่อสอบถามได้ที่ ชั้น 2 อาคารสํานักงานอธิการบดี 126 ถ.ประชาอุทิศ แขวงบางมด เขตทุ่งครุ กรุงเทพฯ 10140 โทรศัพท์ :  02-470-8097-98, 8107 โทรสาร :   02-427-8100 Email : financial.aid@mail.kmutt.ac.th เว็บไซต์ :  www.kmutt.ac.th/financialaid Facebook : งานทุนการศึกษา มจธ. ค่ะ")
            #นำทางไปยังสถานที่ติดต่อ
            if "ไปยังไง" in detail or "ทางไหน" in detail or "อยู่ตรงไหน" in detail :
                qclear=2
                print("แสดงแผนที่เส้นทางไปอาคารเรียนรวมสอง")
            else:
                print("อยากทราบทุนของระดับปริญญาตรีหรือระดับบัณฑิตคะ")
                ask = input()
                            #ุแสดงทุนระดับปริญญาตรีทั้งหมด
                if "ปริญญาตรี" in ask or "ป.ตรี" in ask or "ป. ตรี" in ask or "ปตรี" in ask or "ป ตรี" in ask or "ปอตรี" in ask: 
                    qclear=2
                    print("ทุนการศึกษาระดับปริญญาตรีมี 2 ประเภท คือ ทุนการศึกษาสำหรับนักศึกษาปัจจุบัน และ ทุนการศึกษาเพื่อคัดเลือกนักศึกษาเชิงรุก(ก่อนเข้าศึกษา)")
                    print("คุณอยากทราบข้อมูลของทุนประเภทไหน (สำหรับนศ.ปัจจุบัน หรือ ทุนก่อนเข้าศึกษา)")
                    detail1=input()
                    if "สำหรับนศ.ปัจจุบัน" in detail1 or "ปัจจุบัน" in detail1:
                        print("ทุนสำหรับนศ.ปัจจุบัน จะมีทั้งหมด 5 ทุน")
                        print("1.ทุนการศึกษาเจียระไนเพชร ทุนพัฒนาศักยภาพและส่งเสริมนักศึกษาที่มีผลงานโดดเด่นเป็นที่ยอมรับทั้งระดับประเทศและนานาชาติ ในด้านวิชาการและความสามารถเฉพาะด้านต่าง ๆ เช่น กีฬา ผู้นำ ศิลปวัฒนธรรม และความคิดสร้างสรรค์และนวัตกรรม รวมทั้งส่งเสริม สนับสนุน และสร้างขวัญกำลังใจให้กับนักศึกษาที่สร้างชื่อเสียงให้แก่มหาวิทยาลัย")
                        print("2.ทุนให้เปล่าจากบริษัทและผู้มีจิตกุศล ทุนการศึกษาที่ได้รับจากบริษัท ห้างร้าน และผู้มีจิตกุศล เพื่อช่วยเหลือนักศึกษาที่ขาดแคลนทุนทรัพย์ แต่มีผลการเรียนและความประพฤติดี ในแต่ละปีมหาวิทยาลัยได้รับเงินบริจาคมากกว่า 200 ทุน ทั้งแบบต่อเนื่องจนจบหลักสูตรและแบบรายปี ตามวัตถุประสงค์ของผู้บริจาค")
                        print("3.ทุนจ้างงานนักศึกษา ทุนจ้างงานนักศึกษาเป็นกลไกการพัฒนานักศึกษา ส่งเสริมให้ใช้เวลาว่างให้เกิดประโยชน์ เป็นการฝึกทักษะทางสังคม สร้างความรับผิดชอบและหารายได้พิเศษ ในแต่ละภาคการศึกษา มจธ. มีทุนจ้างงานนักศึกษาจำนวนมาก ซึ่งผู้รับทุนต้องปฏิบัติงานที่หน่วยงานต่างๆ ของมหาวิทยาลัย")
                        print("4.ทุนจ้างงานผู้ช่วยวิจัย ทุนที่ทำให้นักศึกษามีโอกาสเข้าถึงและสร้างทักษะการทำงานวิจัยด้านวิทยาศาสตร์และเทคโนโลยีตั้งแต่ระดับปริญญาตรี สร้างความรับผิดชอบและให้มีฉันทะในการเรียนเนื่องจากเป็นการเรียนรู้นอกห้องเรียนผ่านการปฏิบัติงานจริง โดยผู้รับทุนต้องทำงานในกลุ่มวิจัยต่างๆ ของมหาวิทยาลัย ภายใต้การดูแลของอาจารย์ที่ปรึกษางานวิจัย")
                        print("5.กองทุนให้กู้ยืมเพื่อการศึกษาของรัฐบาล (กยศ.) และกองทุนเงินกู้ยืมเพื่อการศึกษาที่ผูกกับรายได้ในอนาคต (กรอ.) รัฐบาลให้การสนับสนุนการขยายโอกาสและพัฒนาการศึกษาของประเทศ เพื่อให้เยาวชนไทยได้รับการศึกษาที่มีคุณภาพได้มาตรฐานอย่างเท่าเทียม โดยให้เงินกู้ยืมแก่นักเรียนนักศึกษาที่ขาดแคลนทุนทรัพย์ เพื่อเป็นค่าเล่าเรียน ค่าใช้จ่ายเกี่ยวกับการศึกษา และค่าใช้จ่ายจำเป็นในการครองชีพระหว่างศึกษา การให้ทุนพิจารณาจากรายได้ของครอบครัวเป็นหลักและผู้ได้รับทุน (ผู้กู้) เริ่มใช้คืนเมื่อมีรายได้เพียงพอสามารถเลี้ยงตัวได้")
                        print("สามารถดูรายละเอียดทุนต่างๆได้ที่ http://admission.kmutt.ac.th/afford")
                    if "ทุนก่อนเข้าศึกษา" in detail1 or "ก่อน" in detail1:
                        print("สำหรับทุนก่อนเข้าศึกษา จะมีทั้งหมด 3 ทุน")
                        print("1.ทุนการศึกษาเพชรพระจอมเกล้าระดับปริญญาตรี คือ ทุนการศึกษาเพื่อคัดเลือกนักศึกษาเชิงรุกให้ได้ผู้ที่มีความเป็นเลิศในด้านต่างๆ ทั้งด้านวิชาการดีเด่นและความสามารถเฉพาะด้าน ได้แก่ กีฬา ผู้นำ ศิลปวัฒนธรรม และความคิดสร้างสรรค์และนวัตกรรม ผู้ที่ได้รับทุนนี้จะเป็นผู้นำเพื่อการเปลี่ยนแปลง (Change Agent) ในสังคมนักศึกษา มจธ.")
                        print("2.ทุนการศึกษา 50 ปี มจธ. 50 ทุน สร้างคนเก่งและดี ในโอกาสครบ 50 ปี แห่งการก่อตั้ง มจธ. มหาวิทยาลัยฯ สนับสนุนทุนการศึกษาเพื่อสร้างคนเก่งและดีตามวิสัยทัศน์ โดยคัดสรรนักเรียนที่ดี มีคุณธรรม จริยธรรม มีจิตใจในการบริการสังคม และมีฉันทะที่จะเข้าศึกษาต่อในสาขาต่าง ๆ ของ มจธ.")
                        print("3.ทุนการศึกษาธรรมรักษา ทุนการศึกษาสำหรับนักเรียนที่มีคุณธรรมแต่ครอบครัวขาดโอกาสโดยไม่มีบุคคลในครอบครัวสำเร็จการศึกษาระดับอุดมศึกษา และมีภูมิลำเนาในพื้นที่ทุรกันดารห่างไกลความเจริญ หรือพื้นที่เสี่ยงต่อความมั่นคงของประเทศ ให้ได้เข้าศึกษาในมหาวิทยาลัย เพื่อเป็นกำลังสำคัญในการพัฒนาครอบครัว และสังคมหลังสำเร็จการศึกษา")
                        print("สามารถดูรายละเอียดทุนต่างๆได้ที่ http://admission.kmutt.ac.th/afford")
                #แสดงทุนระดับบัณฑิตศึกษาทั้งหมด
                if "บัณฑิตศึกษา" in ask or "บัณฑิต" in ask or "บันฑิต" in ask or "บันดิด" in ask or "บัณฑิด" in ask or "ปริญญาโท" in ask or "ป.โท" in ask or "ปโท" in ask or "ปริญญาเอก" in ask or "ป.เอก" in ask or "ปเอก" in ask: 
                    qclear=2
                    print("ทุนการศึกษาระดับบัณฑิตศึกษามี 2 ประเภท คือ ทุนการศึกษาสำหรับนักศึกษาปัจจุบัน และ ทุนการศึกษาเพื่อคัดเลือกนักศึกษาเชิงรุก(ก่อนเข้าศึกษา)")
                    print("คุณอยากทราบข้อมูลของทุนประเภทไหน (สำหรับนศ.ปัจจุบัน หรือ ทุนก่อนเข้าศึกษา)")
                    detail1=input()
                    if "สำหรับนศ.ปัจจุบัน" in detail1 or "นศ.ปัจจุบัน" in detail1 or "ปัจจุบัน" in detail1:
                        print("ทุนสำหรับนศ.ปัจจุบันจะมี 2 ประเภท")
                        print("1.ทุนผู้ช่วยวิจัย (Research Assistant) / ผู้ช่วยสอน (Teaching Assistant) ทุนการศึกษาสำหรับนักศึกษาระดับบัณฑิตศึกษา โดยผู้ช่วยวิจัยรับผิดชอบงานในโครงการวิจัย/ช่วยวิจัย ร่วมกับอาจารย์/นักวิจัย ตามที่ได้รับมอบหมาย ผู้ช่วยสอน ต้องปฏิบัติหน้าที่ผู้ช่วยสอน หรืองานอื่นๆ ที่ได้รับมอบหมาย สามารถดูรายละเอียดทุนต่างๆได้ที่ http://admission.kmutt.ac.th/afford")
                        print("2.ทุนการศึกษาระดับบัณฑิตศึกษา โครงการพัฒนาเสริมสร้างความรู้งานวิจัยด้านวิทยาศาสตร์ระบบโลก มีทุนการศึกษาให้กับนักศึกษาที่มีคุณสมบัติเหมาะสม ไม่เกิน 50,000 บาทต่อปี ในระดับปริญญาเอก และไม่เกิน 40,000 บาทต่อปี ในระดับปริญญาโท และ/หรือจะได้รับทุนสนับสนุนค่าใช้จ่ายประจำเดือน จำนวน 8,000 บาทต่อเดือนเป็นระยะ 1 ปีการศึกษา (12 เดือน) ทั้งนี้ขึ้นอยู่กับการพิจารณาของคณะกรรมการบริหารโครงการฯ สนใจติดต่อได้ที่: โครงการพัฒนาเสริมสร้างความรู้งานวิจัยด้านวิทยาศาสตร์ระบบโลก (Earth Systems Science: ESS) ตึกคณะพลังงานสิ่งแวดล้อมและวัสดุ ชั้น 11 โทรศัพท์ 02-4708309-10 ต่อ 4151 โทรสาร  02-4708309-10 ต่อ 4154  E-mail address : saipin.poo@kmutt.ac.th หรือดูรายละเอียดเพิ่มเติมได้ที่ www.ess.kmutt.ac.th นะคะ")
                    if "ทุนก่อนเข้าศึกษา" in detail1 or "ก่อน" in detail1:  
                        print("สำหรับทุนก่อนเข้าศึกษา จะมีทั้งหมด 2 ประเภท")
                        print("1.ทุนการศึกษาเพชรพระจอมเกล้าด้านวิชาการดีเด่นและทุนการศึกษาเพชรพระจอมเกล้าสนับสนุนกลุ่มวิจัยระดับปริญญาโท ทุนการศึกษาเพชรพระจอมเกล้าสำหรับนักศึกษาระดับปริญญาโท ที่มีศักยภาพและความสามารถ มีความพึงพอใจใฝ่รู้ โดยให้การสนับสนุนตามระยะเวลาการศึกษาที่ระบุไว้ในหลักสูตร")
                        print("2.ทุนการศึกษาเพชรพระจอมเกล้าดุษฎีบัณฑิต ทุนการศึกษาเพชรพระจอมเกล้าดุษฎีบัณฑิต เพื่อให้นักศึกษาทุ่มเทเวลาให้กับการศึกษาระดับปริญญาเอกและเสริมสร้างประสบการณ์การทำงานวิจัยและพัฒนาอย่างต่อเนื่อง เพื่อพัฒนาตนเองให้เป็นดุษฎีบัณฑิตคุณภาพที่จะเป็นกำลังสำคัญในการขับเคลื่อนและผลิตผลงานวิจัย หรือปฏิบัติงานที่ใช้ความรู้และทักษะขั้นสูงที่เป็นประโยชน์ต่อสังคมและเศรษฐกิจของประเทศ")
                        print("สามารถดูรายละเอียดทุนต่างๆได้ที่ http://admission.kmutt.ac.th/afford")
        #หอพักนักศึกษา
        if "หอพักนักศึกษา" in detail or "หอ" in detail or "ที่พักนศ." in detail or "ที่พักนักศึกษา" in detail or "ที่พักนศ" in detail:
            qclear=1
            #หอพักนศหญิง
            if "หญิง" in detail or "ญ" in detail:
                qclear=2
                print("อาคารหอพักนักศึกษาหญิง สูง 11 ชั้น รับนักศึกษาเข้าพักได้ 944 คน ระดับปริญญาตรี มีห้องแบบพักได้ห้องละ 4 คน และห้องละ 2 คน ตัวอาคารหอพักมีระบบสาธารณูปโภคทันสมัย ลิฟท์ ระบบเตือนภัย และบันไดหนีไฟ การเข้า - ออก บริเวณหอพักใช้ระบบ Key Card ค่ะ")
            #หอพักนศชาย
            if "ชาย" in detail or "ช" in detail:
                qclear=2
                print("อาคารหอพักนักศึกษาชาย สูง 10 ชั้น รับนักศึกษา เข้าพักได้ 388 คน ระดับปริญญาตรี มีห้องแบบพักได้ห้องละ 4 คน และห้องละ 2 คน ตัวอาคารหอพักมีระบบสาธารณูปโภคทันสมัย ลิฟท์ ระบบเตือนภัย และบันไดหนีไฟ การเข้า - ออก บริเวณหอพักใช้ระบบ Key Card ค่ะ")
            #สถานที่ติดต่อ
            if "ติดต่อ" in detail or "สมัครเข้า" in detail or "สมัคร" in detail or "ทำเรื่อง" in detail or "โทร" in detail:
                qclear=2
                print("สามารถติดต่อสอบถามได้ที่ 126 ถ.ประชาอุทิศ แขวงบางมด เขตทุ่งครุ กรุงเทพฯ 10140 โทรศัพท์: 0-2470-8461 โทรสาร: 0-2470-8460 สำนักงานหอพักเปิดทำการ: จันทร์-ศุกร์ 08.00-19.00 น. เสาร์-อาทิตย์ 08.00-17.00 น. เว็บไซต์: http://www.residencehall.kmutt.ac.th อีเมล์: dorm.kmutt@kmutt.ac.th")
            if "ไปยังไง" in detail or "ทางไหน" in detail or "อยู่ตรงไหน" in detail :
                qclear=2
                print("แสดงแผนที่เส้นทางไปหอชาย")
        #การขอทำบัตรนักศึกษาใหม่
        if "ทำบัตรนักศึกษาใหม่" in detail or "ทำบัตรนักศึกษา" in detail or "ทำบัตรนศ" in detail or "ทำบัตรนศ" in detail or "บัตรนศ." in detail or "ทำบัตรนักศึกษาหาย" in detail or "บัตรนศ.หาย" in detail or "บัตรนศหาย" in detail:
            qclear=2
            print("กรณีที่นักศึกษาทำบัตรนักศึกษาหาย บัตรชำรุด สามารถทำใหม่ได้ โดยปฎิบัติตามขั้นตอนดังนี้")
            print("1.นักศึกษาขอใบคำร้องขอทำบัตรนักศึกษาใหม่ (สทน.15) ที่ The Hub ชั้น 1 อาคารสำนักงานอธิการบดี หรือดาวน์โหลดที่ http://regis.kmutt.ac.th/service/form/RO-15.pdf")
            print("2.นักศึกษากรอกรายละเอียดในใบคำร้องให้ชัดเจน ครบถ้วนและอ่านง่าย")
            print("3.นักศึกษายื่นคำร้องพร้อมชำระเงิน จำนวน 100 บาท ที่ The Hub ชั้น 1 อาคารสำนักงานอธิการบดี")
            print("4.นักศึกษารับเอกสารสำหรับติดต่อทำบัตรนักศึกษา พร้อมสลิปใบเสร็จ")
            print("5.นักศึกษาติดต่อถ่ายรูปเฉพาะวันจันทร์ และพฤหัสบดี เวลา 09.00-12.00 น. และ 13.00 - 16.30 น. ที่ The Hub ชั้น 1 อาคารสำนักงานอธิการบดี")
            print("6.รอรับบัตรนักศึกษาใหม่")
            print("หมายเหตุ :กรณีนักศึกษาต้องการใช้รูปเดิม และไม่ได้มารับบริการในวันที่กำหนด (วันจันทร์ และวันพฤหัสบดี) นักศึกษาสามารถรับบัตรนักศึกษาใหม่ได้ ในช่วงบ่ายของวันถัดไป ในช่วงของการสอบกลางภาค และปลายภาค เปิดให้บริการทำบัตรทุกวันทำการ")
        if "บัตรประจำตัวเจ้าหน้าที่" in detail or "บัตรเจ้าหน้าที่" in detail or "บัตรประจำตัวบุคลากร" in detail:
            qclear=2
            print("สำหรับบุคลากรสามารถติดต่อยื่นคำร้องขอมีบัตรประจำตัวบุคลากรได้ที่สำนักงานบริหารทรัพยากรบุคคล อาคารสำนักงานอธิการบดี ชั้น 5 ค่ะ")
        #ตรวจสอบจดหมายและพัสดุไปรษณีย์
        if "จดหมาย" in detail or "พัสดุ" in detail or "ไปรษณีย์" in detail:
            qclear=2
            print("1.จดหมาย-พัสดุไปรษณีย์,ลงทะเบียน,EMS ติดต่อขอรับได้ที่ห้องพัสดุ-ไปรษณีย์ ชั้น 1 สำนักงานอธิการบดี")
            print("2.เฉพาะจดหมายทั่วไป,จดหมายไม่ระบุ,หน่วยงานรับ ติดต่อขอรับได้ที่ งานกิจกรรมนักศึกษา ชั้น 1 อาคารพระจอมเกล้าราชานุสรณ์ 190 ปี")
        #ที่พัก Heliconia House 
        if "ที่พัก Heliconia House" in detail or "ที่พัก heliconia house" in detail or "ที่พักHeliconia House" in detail or "ที่พักheliconia house" in detail or "Heliconia House" in detail or "heliconia house" in detail or "Heliconia" in detail or "heliconia" in detail:
            qclear=2
            print("Heliconia House โรงแรมและเซอร์วิส อพาร์ทเมนท์ มจธ. เปิดให้บริการ ณ ชั้น 12-14 อาคารจอดรถ มจธ.บางมด สำรองที่พักและสอบถามข้อมูลเพิ่มเติมได้ที่ โทรศัพท์: 0-2470-8487-9, 096-886-0499 เว็บไซต์: www.heliconiahouse.kmutt.ac.th ค่ะ")
        #ระเบียบการยืมและค่าปรับ
        if "ยืมหนังสือ" in detail or "ยืมนส." in detail or "ยืมนส" in detail or "คืนหนังสือ" in detail or "คืนนส." in detail or "คืนนส" in detail:
            qclear=1
            if "หอสมุด" in detail or "ห้องสมุด" in detail or "หอสมุด" in olddetail or "ห้องสมุด" in olddetail:
                if "กี่เล่ม" in detail:
                    qclear=2
                    print("อาจารย์,นักวิจัย สามารถยืมหนังสือได้ 20 เล่ม ระยะเวลา 30 วัน\nพนักงาน, ข้าราชการ, นักวิจัยโครงการ, ผู้ช่วยนักวิจัยโครงการและนักศึกษา สามารถยืมหนังสือได้ 10 เล่ม ระยะเวลา 15 วัน\nลูกจ้าง สามารถยืมหนังสือได้ 5 เล่ม ระยะเวลา 15 วัน")
                    print("หากคืนเกินกำหนดคิดค่าปรับ 5 บาท/1 เล่ม")
                if "เกินกำหนด" in detail or "เกินวัน" in detail or "ปรับวันละ" in detail:
                    qclear=2
                    print("หากคืนเกินกำหนดคิดค่าปรับ 5 บาท/1 เล่ม")
                if "หาย" in detail or "ขาด" in detail or "เปียก" in detail or "สูญหาย" in detail or "พัง" in detail or "เลอะ" in detail :
                    qclear=2
                    print("กรณีหนังสือชำรุด สูญหายต้องปฏิบัติดังต่อไปนี้")
                    print("- แจ้งรายการหนังสือเล่มที่ชำรุด สูญหาย ที่เคาน์เตอร์บริการยืม – คืน ชั้น 1 หรือชั้น 3")
                    print("- ผู้ใช้ที่ทำหนังสือหายต้องชดใช้หนังสือชื่อเรื่อง, ผู้แต่ง และปีที่พิมพ์เดิมมาแทนเล่มที่หาย แล้วชำระค่าดำเนินการ เล่มละ 50 บาท")
                    print("- กรณีหนังสือเล่มที่หายไม่มีจำหน่ายหรือผู้จัดพิมพ์ได้ยกเลิกการจัดพิมพ์หนังสือเล่มที่หายแล้ว กรุณาติดต่อเจ้าหน้าที่เคานเตอร์บริการ ชั้น 3 เพื่อประสานงานกับฝ่ายพัฒนาทรัพยากร")
                    print("- สำนักหอสมุดฯ ไม่รับชดใช้หนังสือที่ทำสำเนาหรือหนังสือที่ใช้แล้ว")
                if "ที่ไหน" in detail:
                    qclear=2
                    print("เคาน์เตอร์บริการยืม–คืน อยู่บริเวณ ชั้น 1 หรือชั้น 3 ก็ได้ค่ะ")
            else:
                print("หนังสือจากที่ไหนนะคะ")
                ask = input()
                if  "หอสมุด" in ask or "ห้องสมุด" in ask :
                    if "กี่เล่ม" in detail:
                        qclear=2
                        print("อาจารย์,นักวิจัย สามารถยืมหนังสือได้ 20 เล่ม ระยะเวลา 30 วัน\nพนักงาน, ข้าราชการ, นักวิจัยโครงการ, ผู้ช่วยนักวิจัยโครงการและนักศึกษา สามารถยืมหนังสือได้ 10 เล่ม ระยะเวลา 15 วัน\nลูกจ้าง สามารถยืมหนังสือได้ 5 เล่ม ระยะเวลา 15 วัน")
                        print("หากคืนเกินกำหนดคิดค่าปรับ 5 บาท/1 เล่ม")
                    if "เกินกำหนด" in detail or "เกินวัน" in detail or "ปรับวันละ" in detail:
                        qclear=2
                        print("หากคืนเกินกำหนดคิดค่าปรับ 5 บาท/1 เล่ม")
                    if "หาย" in detail or "ขาด" in detail or "เปียก" in detail or "สูญหาย" in detail or "พัง" in detail or "เลอะ" in detail :
                        qclear=2
                        print("กรณีหนังสือชำรุด สูญหายต้องปฏิบัติดังต่อไปนี้")
                        print("- แจ้งรายการหนังสือเล่มที่ชำรุด สูญหาย ที่เคาน์เตอร์บริการยืม – คืน ชั้น 1 หรือชั้น 3")
                        print("- ผู้ใช้ที่ทำหนังสือหายต้องชดใช้หนังสือชื่อเรื่อง, ผู้แต่ง และปีที่พิมพ์เดิมมาแทนเล่มที่หาย แล้วชำระค่าดำเนินการ เล่มละ 50 บาท")
                        print("- กรณีหนังสือเล่มที่หายไม่มีจำหน่ายหรือผู้จัดพิมพ์ได้ยกเลิกการจัดพิมพ์หนังสือเล่มที่หายแล้ว กรุณาติดต่อเจ้าหน้าที่เคานเตอร์บริการ ชั้น 3 เพื่อประสานงานกับฝ่ายพัฒนาทรัพยากร")
                        print("- สำนักหอสมุดฯ ไม่รับชดใช้หนังสือที่ทำสำเนาหรือหนังสือที่ใช้แล้ว")
                    if "ที่ไหน" in detail:
                        qclear=2
                        print("เคาน์เตอร์บริการยืม–คืน อยู่บริเวณ ชั้น 1 หรือชั้น 3 ก็ได้ค่ะ")
                if qclear!=2:
                    print("ขอโทษค่ะ iGuide รู้แค่ระเบียบการยืมคืนหนังสือภายในหอสมุด มจธ. เท่านั้นค่ะ")
        #ทำหนังสือหอสมุดหาย
        if "หนังสือที่ยืมมาหาย" in detail or "หนังสือหาย" in detail or "หนังสือชำรุด" in detail or "หนังสือหาย" in detail or "หนังสือพัง" in detail or "หนังสือเปียก" in detail or "หนังสือเลอะ" in detail or "หนังสือขาด" in detail :
            qclear=1
            if "หอสมุด" in detail or "ห้องสมุด" in detail:
                qclear=2
                print("กรณีหนังสือชำรุด สูญหายต้องปฏิบัติดังต่อไปนี้")
                print("- แจ้งรายการหนังสือเล่มที่ชำรุด สูญหาย ที่เคาน์เตอร์บริการยืม – คืน ชั้น 1 หรือชั้น 3")
                print("- ผู้ใช้ที่ทำหนังสือหายต้องชดใช้หนังสือชื่อเรื่อง, ผู้แต่ง และปีที่พิมพ์เดิมมาแทนเล่มที่หาย แล้วชำระค่าดำเนินการ เล่มละ 50 บาท")
                print("- กรณีหนังสือเล่มที่หายไม่มีจำหน่ายหรือผู้จัดพิมพ์ได้ยกเลิกการจัดพิมพ์หนังสือเล่มที่หายแล้ว กรุณาติดต่อเจ้าหน้าที่เคานเตอร์บริการ ชั้น 3 เพื่อประสานงานกับฝ่ายพัฒนาทรัพยากร")
                print("- สำนักหอสมุดฯ ไม่รับชดใช้หนังสือที่ทำสำเนาหรือหนังสือที่ใช้แล้ว")
            else:
                if  "หอสมุด" in olddetail or "ห้องสมุด" in olddetail :
                    qclear=2
                    print("กรณีหนังสือชำรุด สูญหายต้องปฏิบัติดังต่อไปนี้")
                    print("- แจ้งรายการหนังสือเล่มที่ชำรุด สูญหาย ที่เคาน์เตอร์บริการยืม – คืน ชั้น 1 หรือชั้น 3")
                    print("- ผู้ใช้ที่ทำหนังสือหายต้องชดใช้หนังสือชื่อเรื่อง, ผู้แต่ง และปีที่พิมพ์เดิมมาแทนเล่มที่หาย แล้วชำระค่าดำเนินการ เล่มละ 50 บาท")
                    print("- กรณีหนังสือเล่มที่หายไม่มีจำหน่ายหรือผู้จัดพิมพ์ได้ยกเลิกการจัดพิมพ์หนังสือเล่มที่หายแล้ว กรุณาติดต่อเจ้าหน้าที่เคานเตอร์บริการ ชั้น 3 เพื่อประสานงานกับฝ่ายพัฒนาทรัพยากร")
                    print("- สำนักหอสมุดฯ ไม่รับชดใช้หนังสือที่ทำสำเนาหรือหนังสือที่ใช้แล้ว")
                else:
                    print("คุณยืมหนังสือมาจากที่ไหนคะ")
                    ask = input()
                    if  "หอสมุด" in ask or "ห้องสมุด" in ask :
                        qclear=2
                        print("กรณีหนังสือชำรุด สูญหายต้องปฏิบัติดังต่อไปนี้")
                        print("- แจ้งรายการหนังสือเล่มที่ชำรุด สูญหาย ที่เคาน์เตอร์บริการยืม – คืน ชั้น 1 หรือชั้น 3")
                        print("- ผู้ใช้ที่ทำหนังสือหายต้องชดใช้หนังสือชื่อเรื่อง, ผู้แต่ง และปีที่พิมพ์เดิมมาแทนเล่มที่หาย แล้วชำระค่าดำเนินการ เล่มละ 50 บาท")
                        print("- กรณีหนังสือเล่มที่หายไม่มีจำหน่ายหรือผู้จัดพิมพ์ได้ยกเลิกการจัดพิมพ์หนังสือเล่มที่หายแล้ว กรุณาติดต่อเจ้าหน้าที่เคานเตอร์บริการ ชั้น 3 เพื่อประสานงานกับฝ่ายพัฒนาทรัพยากร")
                        print("- สำนักหอสมุดฯ ไม่รับชดใช้หนังสือที่ทำสำเนาหรือหนังสือที่ใช้แล้ว")
    #บริการสำหรับนักศึกษา
        #1. บริการประกันอุบัติเหตุนักศึกษา (งานบริการนักศึกษา)
        if "ประกันอุบัติเหตุนักศึกษา" in detail or "ประกันอุบัติเหตุ" in detail or "อุบัติเหตุ" in detail:
            qclear=2
            print(" เมื่อนักศึกษาประสบอุบัติเหตุสามารถเข้ารับการรักษาพยาบาล โดยไม่ต้องสำรองจ่ายค่ารักษาพยาบาล ในกรณีที่นักศึกษาแสดงบัตรประจำตัวผู้เอาประกันภัยและบัตรนักศึกษา / บัตรประชาชน ณ โรงพยาบาลตาม รายชื่อสถานพยาบาล สามารถสอบถามรายละเอียดได้ที่ งานบริการนักศึกษา กองกิจการนักศึกษา ชั้น 2 สำนักงานอธิการบดี โทร.0-2470-8110 ")
            print(" กรณีนักศึกษาสำรองจ่ายค่ารักษาพยาบาล สามารถเบิกค่ารักษาพยาบาลคืนได้โดยใช้เอกสาร ดังต่อไปนี้ \n1)  ดาวน์โหลดและกรอกข้อมูลในเอกสารแบบฟอร์มขอรับค่าสินไหม \n2)  นำเอกสารมายื่นที่ งานบริการนักศึกษา กองกิจการนักศึกษา ชั้น 2 อาคารสำนักงานอธิการบดี พร้อมเอกสารดังนี้ \n    -  สำเนาบัตรนักศึกษาพร้อมรับรองสำเนาถูกต้อง \n    -  ใบเสร็จรับเงิน (ฉบับจริง) \n    -  ใบรับรองแพทย์ (ฉบับจริง) \n    -  ใบลงบันทึกประจำวัน (กรณีถูกทำร้ายร่างกาย) ")
        #2. บริการลดหย่อนค่าโดยสารรถไฟ (งานบริการนักศึกษา)
        if "ลดหย่อนค่าโดยสารรถไฟ" in detail or "ลดค่าโดยสารรถไฟ" in detail or "ลดค่ารถไฟ" in detail or "ค่าโดยสารรถไฟ" in detail or "ค่ารถไฟ" in detail:
            qclear=2
            print("การบริการลดหย่อนค่าโดยสารรถไฟ สำหรับนักศึกษาที่มีภูมิลำเนาอยู่ต่างจังหวัดและประสงค์เดินทางกลับภูมิลำเนาเดิม ในระหว่างปิดภาคการศึกษาฤดูร้อน ให้ยื่นความจำนงขอทำสมุดประจำตัวนักศึกษาสำหรับลดหย่อนค่าโดยสารรถไฟ (เฉพาะชั้น 3) ได้ที่ งานบริการนักศึกษา กองกิจการนักศึกษา ชั้น 2 อาคารสำนักงานอธิการบดี โทร.0-2470-8110 ได้ตั้งแต่วันที่ 15 ธันวาคม จนถึงวันที่ 16 กุมภาพันธ์ ")
            if "หลักฐาน" in detail or "เอกสาร" in detail or "ต้องใช้" in detail or "ต้องมี" in detail or "ต้องนำ" in detail:
                print("คุณมีสมุดประจำตัวหรือยังค่ะ?")
                ask = input()
                if "มี" in ask :
                    print("สำหรับนักศึกษาเก่าซึ่งเคยมีสมุดประจำตัวแล้ว ให้นำสมุดเก่ามายื่นที่งานบริการนักศึกษา กองกิจการนักศึกษา *ต้องมีอายุไม่เกิน 25 ปี ")
                if "ยัง" in ask or "ไม่" in ask:
                    print("สำหรับนักศึกษาใหม่ซึ่งไม่เคยมีสมุดประจำตัวลดค่าโดยสารรถไฟ ต้องใช้หลักฐานดังนี้\n- รูปถ่ายขนาด 3 x 4 ซ.ม. จำนวน 1 รูป \n- สำเนาบัตรนักศึกษา \n- สำเนาทะเบียนบ้านของบิดา มารดา หรือผู้ปกครอง 1 ชุด \n- ต้องมีอายุไม่เกิน 25 ปี \n- เงินค่าสมุด 5 บาท ")
        #3. บริการทุนการศึกษา (งานแนะแนวการศึกษาและอาชีพ) ** อยู่ในหัวข้อทุนแล้ว  
        #4. บริการให้คำปรึกษา (งานแนะแนวการศึกษาและอาชีพ)
        if "บริการให้คำปรึกษา" in detail or "ปรึกษา" in detail:
            qclear=2
            print("มจธ. จัดให้มีอาจารย์ และเจ้าหน้าที่ให้คำปรึกษาแก่นักศึกษาที่มีปัญหาด้านการเรียน การปรับตัว ปัญหา ครอบครัว ฯลฯ เพื่อให้นักศึกษาสามารถศึกษาเล่าเรียน และอยู่ในสังคมได้อย่างมีความสุข นักศึกษาสามารถขอรับคำปรึกษาได้ ณ ห้องให้คำปรึกษา กองกิจการนักศึกษา ชั้น 2 อาคารสำนักงานอธิการบดี โทร.0-2470-8093 ในวันและเวลาราชการ โดยจะมีอาจารย์และเจ้าหน้าที่อยู่ประจำให้คำปรึกษา ")
        #5. บริการนักศึกษาฝึกงาน (งานแนะแนวการศึกษาและอาชีพ)
        if "บริการนักศึกษาฝึกงาน" in detail or "หาที่ฝึกงานไม่ได้" in detail or "หาที่ฝึกงาน" in detail:
            qclear=2
            print("ทางมหาวิทยาลัยมีบริการนักศึกษาฝึกงาน เป็นบริการที่จัดให้กับนักศึกษาตามหลักสูตร ดังนี้ \n- ติดต่อหาสถานที่ฝึกงานให้กับนักศึกษา \n- จัดนักศึกษาเข้าฝึกงานในหน่วยงานที่ตอบรับ \n- ให้ข้อแนะนำนักศึกษาก่อนออกฝึกงาน \n- จัดปฐมนิเทศนักศึกษาฝึกงาน \nติดต่อสอบถามรายละเอียดได้ที่ งานแนะแนวการศึกษาและอาชีพ กองกิจการนักศึกษา ชั้น 2 อาคารสำนักงานอธิการบดี โทร.0-2470-8099 ")
        #6. บริการผ่อนผันราชการทหาร / นักศึกษาวิชาทหาร (งานกีฬา)
        if "ผ่อนผันราชการทหาร" in detail or "ผ่อนผันเกณฑ์ทหาร" in detail or "ผ่อนผันการเกณฑ์ทหาร" in detail or "ผ่อนผันการเกณทหาร" in detail or "ผ่อนผันการเกนทหาร" in detail :
            qclear=2
            print("นักศึกษาที่มีความประสงค์จะขอผ่อนผันราชการทหาร สามารถติดต่อสอบถามและยื่นเอกสารได้จนถึงเดือนธันวาคม ที่งานกีฬา กองกิจการนักศึกษา ชั้นล่าง อาคารพระจอมเกล้าราชานุสรณ์ 190 ปี (โรงอาหาร) โทร.0-2470-8092")
            print("เอกสารที่ใช้มีดังต่อไปนี้ \n- สำเนา สด.9  จำนวน 2 ชุด พร้อมรับรองสำเนาถูกต้อง \n- สำเนา สด.35  จำนวน 2 ชุด พร้อมรับรองสำเนาถูกต้อง \n- สำเนาทะเบียนบ้าน  จำนวน 2 ชุด พร้อมรับรองสำเนาถูกต้อง \n- สำเนาบัตรนักศึกษา  จำนวน 2 ชุด พร้อมรับรองสำเนาถูกต้อง \n- สำเนาบัตรประชาชน  จำนวน 2 ชุด พร้อมรับรองสำเนาถูกต้อง ")
        if "รด" in detail or "ร.ด." in detail:
            qclear=2
            print("นักศึกษาที่มีความประสงค์เรียนวิชาทหาร (ร.ด.) ต่อเนื่อง สามารถติดต่อสอบถามและยื่นเอกสารได้ภายในเดือนพฤษภาคม ที่ งานกีฬา กองกิจการนักศึกษา ชั้นล่าง อาคารพระจอมเกล้าราชานุสรณ์ 190 ปี (โรงอาหาร) โทร.02-470-8092")
            print("เอกสารที่ใช้ คือ หนังสือรับรองการฝึกของนักศึกษาวิชาทหาร")
        #ยื่นใบจบการศึกษา
        if "ขอใบเรียนจบ" in detail or "ใบจบ" in detail or "ใบสำเร็จ" in detail or "ขอสำเร็จการศึกษา" in detail or "ใบรับรองสำเร็จการศึกษา" in detail:
            qclear=2
            print("นักศึกษาทุกระดับการศึกษา (ปริญญาตรีและบัณฑิตศึกษา) ที่คาดว่าจะสำเร็จ การศึกษา ในภาคการศึกษาใดๆ ให้ดำเนินการโดยปฎิบัติตามขั้นตอนต่อไปนี้\n1.นักศึกษาขอใบคำร้อง แสดงความจำนงขอสำเร็จการศึกษา (ในแบบฟอร์ม จะมีใบแสดงความจำนงขอสำเร็จการศึกษา, ใบคำร้องขอใบรายงานผล การศึกษา และใบคำร้องขอใบรับรองสำเร็จการศึกษา)\n2.กรอกรายละเอียดในใบคำร้องให้ครบถ้วน อ่านง่าย ทั้งภาษาไทยและ ภาษาอังกฤษ ทั้ง 3 แผ่น\n3.เขียนชื่อ และที่อยู่ (ของนักศึกษาหรือผู้ปกครอง สำหรับติดต่อเกี่ยวกับ พิธีรับพระราชทานปริญญาบัตรทางไปรษณีย์) ลงในสติกเกอร์ทั้งสองแผ่น\n4.ยื่นใบแสดงความจำนงขอสำเร็จการศึกษา ลงเลขที่ลำดับในสมุด แสดงความจำนงขอสำเร็จการศึกษา (แยกจากสมุดของหนังสือสำคัญอื่นๆ)\n5.ชำระค่าจัดทำใบรายงานผลการศึกษา และใบรับรองสำเร็จการศึกษา พร้อมรูปถ่ายตามระเบียบฯ เท่ากับจำนวนชุดที่ขอ (ชุดละ 30 บาท)\n6.ขอรับใบเสร็จ และใบกำหนดรับเอกสารสำคัญ\n7.นำใบกำหนดรับเอกสารสำคัญพร้อมใบปลอดหนี้จากภาควิชามารับ (กำหนดรับหลังวันประกาศผลสอบ 1 เดือน)\n* กรณีมารับเองไม่ได้ สามารถมอบหมายให้ผู้อื่นมารับแทนได้ โดยระบุ ผู้รับแทน ลงลายมือชื่อ ตนเองไว้ในใบกำหนดรับเอกสารสำคัญ พร้อม บัตรนักศึกษา หรือสำเนาบัตรนักศึกษา หรือสำเนาบัตรประชาชนของ ทั้ง 2 คน")
        #คำถามเกี่ยวกับสถานที่ติดต่อทำธุระ
        if "ติดต่อ" in detail or "ที่ไหน" in detail or "ทำเรื่อง" in detail or "โทร" in detail:
            qclear=2
            #ทุนการศึกษา
            if "ทุน" in detail or "ทุนการศึกษา" in detail:
                qclear=2
                print("สามารถติดต่อสอบถามได้ที่ ชั้น 2 อาคารสํานักงานอธิการบดี 126 ถ.ประชาอุทิศ แขวงบางมด เขตทุ่งครุ กรุงเทพฯ 10140 โทรศัพท์ : 02-470-8097-98, 8107 โทรสาร: 02-427-8100 Email: financial.aid@mail.kmutt.ac.th เว็บไซต์:  www.kmutt.ac.th/financialaid Facebook : งานทุนการศึกษา มจธ. ค่ะ")
            #หอพักนักศึกษา
            if "หอพักนักศึกษา" in detail or "หอ" in detail or "ที่พักนศ." in detail or "ที่พักนักศึกษา" in detail or "ที่พักนศ" in detail:
                qclear=2
                print("สามารถติดต่อสอบถามเรื่องหอพักนักศึกษาได้ที่ 126 ถ.ประชาอุทิศ แขวงบางมด เขตทุ่งครุ กรุงเทพฯ 10140 โทรศัพท์: 0-2470-8461 โทรสาร: 0-2470-8460 สำนักงานหอพักเปิดทำการ: จันทร์-ศุกร์ 08.00-19.00 น. เสาร์-อาทิตย์ 08.00-17.00 น. เว็บไซต์: www.residencehall.kmutt.ac.th อีเมล์: dorm.kmutt@kmutt.ac.th")
            #ทำบัตรนักศึกษาใหม่
            if "บัตรนักศึกษา" in detail or "บัตรนศ" in detail or "บัตรนศ." in detail:
                qclear=2
                print("ทำบัตรนักศึกษาใหม่ สามารถติดต่อสอบถามได้ที่ The Hub ชั้น 1 อาคารสำนักงานอธิการบดี เปิดให้บริการวันจันทร์ และพฤหัสบดี เวลา 09.00-12.00น. และ 13.00 - 16.30น.")
            #ที่พัก Heliconia House 
            if "ที่พัก Heliconia House" in detail or "ที่พัก heliconia house" in detail or "ที่พักHeliconia House" in detail or "ที่พักheliconia house" in detail or "Heliconia House" in detail or "heliconia house" in detail or "Heliconia" in detail or "heliconia" in detail:
                qclear=2
                print("ที่พัก Heliconia House สามารถติดต่อได้ที่ อาคารจอดรถ มจธ. ชั้น 12-14 สำรองที่พักและสอบถามข้อมูลเพิ่มเติมได้ที่ โทรศัพท์: 0-2470-8487-9, 096-886-0499 อีเมลล์: heliconiahouse@kmutt.ac.th เว็บไซต์: www.heliconiahouse.kmutt.ac.th")
            #สำนักงานกิจการนักศึกษา
            if "สำนักงานกิจการนักศึกษา" in detail or "สำนักงานกิจการนศ." in detail or "สำนักงานกิจการนศ" in detail :
                qclear=2
                print("สำนักงานกิจการนักศึกษาสามารถติดต่อได้ที่ มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี 126 ถนนประชาอุทิศ แขวงบางมด เขตทุ่งครุ กรุงเทพมหานคร 10140 โทรศัพท์: 0-2470-8110  โทรสาร: 0-2427-0151")
            #งานกิจกรรมนศ
            if "งานกิจกรรมนักศึกษา" in detail or "งานกิจกรรมนศ" in detail or "งานกิจกรรมนศ." in detail :
                qclear=2
                print("งานกิจกรรมนักศึกษาสามารถติดต่อได้ที่ ชั้น 1 อาคารพระจอมเกล้าราชานุสรณ์ 190 ปี โทรศัพท์: 0-2470-8101 โทรสาร: 0-2428-4026")
            #งานกิจกรรมตามแผนกลยุทธ์ 
            if "งานกิจกรรมตามแผนกลยุทธ์" in detail or "งานกิจกรรมแผนกลยุทธ์" in detail or "งานกิจกรรมกลยุทธ์" in detail :
                qclear=2
                print("งานกิจกรรมตามแผนกลยุทธ์สามารถติดต่อได้ที่ ชั้น 1 อาคารพระจอมเกล้าราชานุสรณ์ 190 ปี โทรศัพท์: 0-2470-8111 โทรสาร: 0-2428-4026")
            #งานพัฒนาความพร้อมสู่อาชีพ 
            if "งานพัฒนาความพร้อมสู่อาชีพ" in detail or "งานพัฒนาความพร้อม" in detail or "งานพัฒนาอาชีพ" in detail :
                qclear=2
                print("งานพัฒนาความพร้อมสู่อาชีพสามารถติดต่อได้ที่ ชั้น 2 อาคารสำนักงานอธิการบดี โทร. 0-2470-8099 โทรสาร 0-2427-0151")
            #งานวินัยและพัฒนานักศึกษา
            if "งานวินัยและพัฒนานักศึกษา" in detail or "งานวินัยละพัฒนานศ." in detail or "งานวินัยและพัฒนา" in detail :
                qclear=2
                print("งานวินัยและพัฒนานักศึกษาสามารถติดต่อได้ที่ ชั้น 1 อาคารพระจอมเกล้าราชานุสรณ์ 190 ปี  โทร. 0-2470-8111 โทรสาร 0-2428-4026")
            #งานจิตวิทยาและให้คำปรึกษา
            if "งานจิตวิทยาและให้คำปรึกษา" in detail or "งานจิตวิทยา" in detail or "งานให้คำปรึกษา" in detail :
                qclear=2
                print("งานจิตวิทยาและให้คำปรึกษาสามารถติดต่อได้ที่ ชั้น 2 อาคารสำนักงานอธิการบดี โทร. 0-2470-8093 โทรสาร 0-2427-0151")
            #งานกีฬาและคุณภาพชีวิต
            if "งานกีฬาและคุณภาพชีวิต" in detail or "งานกีฬา" in detail or "คุณภาพชีวิต" in detail :
                qclear=2
                print("งานกีฬาและคุณภาพชีวิตสามารถติดต่อได้ที่ ชั้น 1 อาคารพระจอมเกล้าราชานุสรณ์ 190 ปี  โทร. 0-2470-8113 โทรสาร 0-2470-8092")
            #การฝึกงาน
            if "การฝึกงาน" in detail or "ฝึกงาน" in detail :
                qclear=2
                print("สามารถติดต่อสอบถามด้านการฝึกงานได้ที่ ชั้น 1 อาคารพระจอมเกล้าราชานุสรณ์ 190 ปี  โทร 02-470-8115 โทรสาร 02-427-0151")
            #จุดให้บริการ ไปรษณีย์ภายใน มจธ. 
            if "ไปรษณีย์" in detail or "ไปรษณี" in detail or "ที่ทำการไปรษณีย์" in detail :
                qclear=2
                print("จุดให้บริการ ไปรษณีย์ภายใน มจธ. อยู่บริเวณใต้อาคารจอดรถ มจธ.")
            #ศูนย์พัฒนาเด็กเล็ก มจธ
            if "ศูนย์พัฒนาเด็กเล็ก" in detail or "พัฒนาเด็กเล็ก" in detail or "อาคารพัฒนาเด็กเล็ก" in detail or "ศูนย์เด็ก" in detail or "อาคารเด็กเล็ก" in detail :
                qclear=2
                print("สถานที่ติดต่อ: อาคารพัฒนาเด็กเล็ก")
                print("ไปถูกมั้ยเอ่ย?")
                ask = input()
                if "ไม่" in ask:
                    print("แสดงเส้นทางไปอาคารพัฒนาเด็กเล็ก")
                else:
                    print("โอเคค่ะ มีอะไรสงสัยมาถาม iGuide ได้อีกนะคะ ขอให้ทำธุระราบรื่นค่ะ^^")
            #บริการลดหย่อนค่าโดยสารรถไฟ
            if "ลดหย่อนค่าโดยสารรถไฟ" in detail or "ลดค่าโดยสารรถไฟ" in detail or "ลดค่ารถไฟ" in detail or "ค่าโดยสารรถไฟ" in detail or "ค่ารถไฟ" in detail:
                qclear=2
                print("สามารถติดต่อบริการลดหย่อนค่าโดยสารรถไฟได้ที่: กองกิจการนักศึกษา ชั้น 2 อาคารสำนักงานอธิการบดี โทร.0-2470-8110")
            #งานบริการวิชาการคณะวิศวกรรมศาสตร์ มจธ.
            if "งานบริการวิชาการคณะวิศวกรรมศาสตร์" in detail or "งานบริการวิชาการคณะวิศว" in detail or "บริการคณะวิศว" in detail :
                qclear=2
                print("สถานที่ติดต่องานบริการวิชาการคณะวิศวกรรมศาสตร์: service center คณะวิศวกรรมศำสตร์ อาคารเรียนรวม 4 ชั้น 1")
            #ขอใช้บริการห้องประชุม/สัมมนา และสถานที่ สำนักงานคณบดี คณะวิศวกรรมศาสตร์ 
            if "ขอใช้ห้องประชุม" in detail or "ขอใช้สถานที่" in detail or "ขอใช้บริการห้องประชุม" in detail or "ขอใช้บริการห้องสัมมนา" in detail or "ขอใช้บริการสถานที่" in detail :
                if "วิศว" in detail:
                    qclear=2
                    print("สามารถติดต่อขอใช้สถานที่คณะวิศวกรรมศาสตร์ได้ที่: service center คณะวิศวกรรมศำสตร์ อาคารเรียนรวม 4 ชั้น 1")
                else:
                    print("iGuide มีเพียงข้อมูลการขอใช้สถานที่ของทางคณะวิศวกรรมศาสตร์นะคะ")
                    print("สามารถติดต่อขอใช้สถานที่คณะวิศวกรรมศาสตร์ได้ที่: service center คณะวิศวกรรมศำสตร์ อาคารเรียนรวม 4 ชั้น 1")
            #ติดต่อสำนักงานคณบดี 
            if "สำนักงานคณบดี" in detail or "คณบดี" in detail  :
                qclear=2
                print("ติดต่อสำนักงานคณบดี กรุณาติดต่อ คุณจำเลียง เสมอ tel: 02-470-9017 fax: 02-427-8787")
            #ติดต่อคณะวิศวกรรมศาสตร์
            if "วิศว" in detail:
                qclear=2
                if "วิศวกรรมเคมี" in detail or "วิศวะเคมี" in detail or "เคมี" in detail or "เคม" in detail:
                    print("ติดต่อวิศวกรรมเคมี กรุณาติดต่อ คุณงามวิไล อรกิจวิโรจน์ tel: 02-470-9222-34 ต่อ 103 ")
                if "วิศวกรรมเครื่องกล" in detail or "วิศวเครื่องกล" in detail or "วิศวะเครื่องกล" in detail or "เครื่องกล" in detail:
                    print("ติดต่อวิศวกรรมเครื่องกล กรุณาติดต่อ คุณเบญจวรรณ ทองขาว tel: 02-470-9123 fax: 02-470-9111 ")
                if "วิศวกรรมไฟฟ้า" in detail or "ไฟฟ้า" in detail:
                    print("ติดต่อวิศวกรรมไฟฟ้า กรุณาติดต่อ คุณกัลยา ปกป้อง tel: 02-470-9043 fax: 02-470-9033, 02-470-9040 ")
                if "วิศวกรรมโยธา" in detail or "โยธา" in detail or "โยทา" in detail:
                    print("ติดต่อวิศวกรรมโยธา กรุณาติดต่อ คุณอังคณารัตน์ กาญจนมณีนิล หรือ คุณพวงทอง ทองบริสุทธิ์ tel: 02-470-9134 fax: 02-872-9063")
                if "วิศวกรรมอุตสาหการ" in detail or "อุตสาห" in detail or "อุต" in detail:
                    print("ติดต่อวิศวกรรมอุตสาหการ กรุณาติดต่อ คุณณัฐิกา ยิ้มวิไล tel: 02-470-9176 ")
                if "วิศวกรรมคอมพิวเตอร์" in detail or "คอม" in detail :
                    print("ติดต่อวิศวกรรมคอมพิวเตอร์ กรุณาติดต่อ คุณนงค์เยาว์ จำปาหอม tel: 02-470-9083 fax: 02-872-5050 ")
                if "วิศวกรรมอาหาร" in detail or "อาหาร" in detail :
                    print("ติดต่อวิศวกรรมอาหาร กรุณาติดต่อ คุณราตรี รวยรวย tel: 02-470-9245")
                if "วิศวกรรมสิ่งแวดล้อม" in detail or "สิ่งแวดล้อม" in detail :
                    print("ติดต่อวิศวกรรมสิ่งแวดล้อม กรุณาติดต่อ คุณนวลจันทร์ เลาหศิริชัยกุล หรือ คุณเด่นใจ โพธิ์ทอง tel: 02-470-9163 fax: 02-470-9165 ")
                if "วิศวกรรมควบคุมและเครื่องมือวัด" in detail or "เครื่องมือวัด" in detail or "ควบคุม" in detail :
                    print("ติดต่อวิศวกรรมควบคุมและเครื่องมือวัด กรุณาติดต่อ คุณชมอร จิตตวงศ์ หรือ คุณนัฐติยา ศรีสะอาด tel: 02-470-9092,96 fax: 02-470-9100")
                if "วิศวกรรมอิเลกโทรนิคและโทรคมนาคม" in detail or "อิเลก" in detail or "อิเล็ก" in detail or "โทรคม" in detail or "คมนาคม" in detail or "โทราคม" in detail:
                    print("ติดต่อวิศวกรรมอิเลกโทรนิคและโทรคมนาคม กรุณาติดต่อ คุณรุ่งเพชร ดอกบัว tel: 02-470-9070")
                if "วิศวกรรมเครื่องมือและวัสดุ" in detail or "เครื่องมือและวัสดุ" or "เครื่องมือวัสดุ" in detail  in detail or "วัสดุ" in detail :
                    print("ติดต่อวิศวกรรมเครื่องมือและวัสดุ กรุณาติดต่อ คุณนพคุณ แท่นมาก tel: 02-470-9213")
                if "วิศวกรรมชีวภาพ" in detail or "ชีวภาพ" in detail:
                    print("ติดต่อวิศวกรรมชีวภาพ กรุณาติดต่อ คุณชลธิชา ปานเกษม tel: 02-470-9391 fax: 02- 470-9391")
                if "วาริชวิศวกรรม" in detail or "วาริช" in detail:
                    print("ติดต่อวาริชวิศวกรรม กรุณาติดต่อ คุณราตรี มณีพรพิพัฒน์ tel: 02-470-9222 ต่อ 102 fax: 02-470-9238 ")
                if "วิศวกรรมเมคคาทรอนิกส์" in detail or "เมคคา" in detail or "แม็คคา" in detail or "เม็คคา" in detail or "เมคคา" in detail or "แม็กคา" in detail or "แมกคา" in detail or "เม็กคา" in detail or "เมกคา"in detail :
                    print("ติดต่อวิศวกรรมเมคคาทรอนิกส์ กรุณาติดต่อ คุณราตรี รอดแก้ว tel: 02-470-9674 fax: 02-470-9710")
            if qclear!=2:
                print("ขอโทษค่ะ iGuide ไม่ทราบข้อมูลการติดต่อที่คุณถามค่ะ")
            #
        #คำถามเกี่ยวกับแหล่งรวมฟอร์มเอกสาร
        if "เอกสาร" in detail or "หลักฐาน" in detail or "ยื่นอะไร" in detail or "ใช้อะไร" in detail or "ส่งอะไรบ้าง" in detail:
            if "ฝึกงาน" in detail:
                qclear=2
                print("สามารถโหลดเอกสารฝึกงานได้ที่นี่ : web.kmutt.ac.th/saffairs/form-download/ \nดูรายละเอียดเพิ่มเติมได้ทางเว็บไซต์ : web.kmutt.ac.th/saffairs/")
            if "ประกันสุขภาพ" in detail or "ประกันอุบัติเหตุ" in detail :
                qclear=2
                print("สามารถโหลดเอกสารประกันอุบัติเหตุและสุขภาพได้ที่ : web.kmutt.ac.th/saffairs/form-download/ \nดูรายละเอียดเพิ่มเติมได้ทางเว็บไซต์ : web.kmutt.ac.th/saffairs/")
            if "วิชาทหาร" in detail or "ทหาร" in detail :
                qclear=2
                print("สามารถโหลดเอกสารคำร้องเกี่ยวกับวิชาทหารได้ที่ : web.kmutt.ac.th/saffairs/form-download/ \nดูรายละเอียดเพิ่มเติมได้ทางเว็บไซต์ : web.kmutt.ac.th/saffairs/")
            if "กีฬา" in detail or "พละ" in detail or "พลศึกษา" in detail or "เพาะกาย" in detail or "ขอตีกลอง" in detail or "ขอใช้สถานที่" in detail or "ขอใช้เสียง" in detail :
                qclear=2
                print("สามารถโหลดเอกสารเกี่ยวกับกีฬา กิจกรรม และการใช้เสียงได้ที่ : web.kmutt.ac.th/saffairs/form-download/ \nดูรายละเอียดเพิ่มเติมได้ทางเว็บไซต์ : web.kmutt.ac.th/saffairs/")
            if "กิจกรรมนักศึกษา" in detail or "กิจกรรมนศ." in detail or "กิจกรรมนศ" in detail or "กิจกรรม" in detail or "ยื่นโครงการ" in detail or "อุปกรณ์" in detail or "งบประมาณ" in detail or "เบิกค่าอาหาร" in detail or "งบ" in detail :
                qclear=2
                print("สามารถโหลดเอกสารเกี่ยวกับกิจกรรมนักศึกษาได้ที่ : web.kmutt.ac.th/saffairs/form-download/ \nดูรายละเอียดเพิ่มเติมได้ทางเว็บไซต์ : web.kmutt.ac.th/saffairs/")
            if "วินัยนักศึกษา" in detail or "วินัย." in detail :
                qclear=2
                print("สามารถโหลดเอกสารคคำร้องเกี่ยวกับวินัยนักศึกษาได้ที่ : web.kmutt.ac.th/saffairs/form-download/ \nดูรายละเอียดเพิ่มเติมได้ทางเว็บไซต์ : web.kmutt.ac.th/saffairs/")
            if qclear!=2:
                print("ขอโทษค่ะ iGuide ไม่มีแหล่งข้อมูลสำหรับคำถามนี้")
        #ขอบคุณ
        if "ขอบคุณ" in detail or "โอเค" in detail or "แต๊งกิ้ว" in detail or "thxu" in detail :
            qclear=1
            print("ยินดีค่ะ ^^")
        #ไม่พอใจ 
        if "ไม่ได้เรื่อง" in detail or "ไม่เจ๋งเลย" in detail or "อ่อน" in detail or "มั่ว" in detail :
            qclear=1
            print("ขอโทษค่ะ ที่ iGuide ช่วยอะไรไม่ได้ TT")
        #ออกจากลูปคำถามเกี่ยวกับธุระ
        if "เส้นทาง" in detail or "ไปยังไง" in detail or "ไปทางไหน" in detail or "อยู่ทางไหน" in detail :
            qclear=1
            print("สลับเข้าโหมดนำทางแทน")
            #typeAsk = 1
            type1()
            break
        if qclear == 0:
            print("iGuide ไม่เข้าใจคำถามค่ะ iGuide สามารถตอบคำถามที่เกี่ยวกับการทำธุระและนำทางคุณไปยังสถานที่ต่างๆภายในมจธ.เท่านั้นค่ะ")
        olddetail = detail #เก็บคำถามก่อนหน้าเพื่อเชื่อมโยงหาคำตอบให้คำถามล่าสุด
        print(qclear)
    return
def type0():
    print("iGuideไม่เข้าใจสิ่งที่คุณถาม กรุณาเลือกประเภทของคำถามก่อนค่ะ ระหว่าง เส้นทาง หรือ รายละเอียดการติดต่อทำธุระ")
    return
def main():        
    print("\nสวัสดีค่ะ! มีอะไรให้ iGuide ช่วยไหมคะ? (เส้นทาง หรือ รายละเอียดการติดต่อทำธุระ)")
    a = input()# u'ฉันรักภาษาไทยเพราะฉันเป็นคนไทย' ใน Python 2.7
    b = word_tokenize(a)
    print(b)
    typeAsk = 0
    for keyword in b:
    #    a=correction(i)
        print(keyword) # ['สี่เหลี่ยม']
        if keyword == "เส้นทาง" or keyword == "ทาง" :
            typeAsk = 1   
        if keyword == "รายละเอียดการติดต่อทำธุระ" or keyword == "ติดต่อทำธุระ" or keyword == "รายละเอียด" or keyword == "ธุระ" :
            typeAsk = 2
    print(typeAsk)
    #type1 คำถามประเภทสอบถามเส้นทาง
    if typeAsk == 1 :
        type1()
    #type2 คำถามประเภทสอบถามรายละเอียดการทำธุระ
    if typeAsk == 2 :
        type2(typeAsk)
    if typeAsk == 0 :
        type0()
    return
#start process
if __name__ == '__main__':
    main()
